interfaces/src/main/resources/templates/GeefDmfaVoorWerknemer/03.00.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://webservice.geefdmfavoorwerknemer-03_00.werk-03_00.vip.vlaanderen.be">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GeefDmfaVoorWerknemer>
            <Verzoek>
                <Context>
                    <Naam>GeefDmfaVoorWerknemer</Naam>
                    <Versie>03.00.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2025-01-01</Datum>
                            <Tijd>12:00</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Identificatie</Identificatie>
                            <Referte>Referte</Referte>
                            <Hoedanigheid>Hoedanigheid</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>${REFERTE}</Referte>
                        <Inhoud>
                            <Criteria>
                                <INSZ>${INSZ}</INSZ>
                                <Kwartaal>
                                    <Begin>
                                        <Jaar>${START_YEAR}</Jaar>
                                        <Kwartaalcijfer>${START_QUARTER}</Kwartaalcijfer>
                                    </Begin>
                                    <Einde>
                                        <Jaar>${END_YEAR}</Jaar>
                                        <Kwartaalcijfer>${END_QUARTER}</Kwartaalcijfer>
                                    </Einde>
                                </Kwartaal>
                            </Criteria>
                            <TypeAntwoord>0</TypeAntwoord>
                            <LaatsteSituatie>0</LaatsteSituatie>
                            <Bron>RSZ</Bron>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </web:GeefDmfaVoorWerknemer>
    </soapenv:Body>
</soapenv:Envelope>